#read design
read_verilog serialParalelo.v
hierarchy -check -top serialParalelo

#the high-level stuff
proc; opt; fsm; opt; memory; opt

#mapping to internal cell library
techmap; opt

#mapping flip-flops tom cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

#mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

#cleanup
clean

#write synthesized design
write_verilog serialParalelo_sintetizado.v
